Пользовательское соглашение
Предоставление услуг ресурса Фотохостинг регламентируется Пользовательским Соглашением, находящимся по адресу 

 

1. Принятие условий

 

1.1. Посещая Фотохостинг или используя продукты, программное обеспечение, данные или услуги, которые предоставляет Фотохостинг (далее \"Услуги\"), вы подтверждаете свое согласие с

(1) данным ПОЛЬЗОВАТЕЛЬСКИМ СОГЛАШЕНИЕМ, находящимся по ссылке 

(2) СОГЛАШЕНИЕМ О КОНФИДЕНЦИАЛЬНОСТИ, находящимся по ссылке 

(3) СОГЛАШЕНИЕМ О НЕНАРУШЕНИИ АВТОРСКИХ ПРАВ, находящимся по ссылке 

 

2. Фотохостинг сервис

 

2.1. Фотохостинг предоставляет Вам законные техническое решение, которое позволяет загружать, хранить, получать доступ и скачивать тексты, программы, скрипты, изображения, звуки, видео, анимации и любые другие материалы (далее \"Контент\") в виде одного или нескольких электронных файлов.

 

3. Ограничения

 

3.1. Вы обязуетесь не загружать нелегальный контент на Фотохостинг, включая, но не ограничиваясь:

 

Контент, нарушающий авторское право, патент, торговую марку, коммерческую тайну или прочие права, принадлежащие каким-либо лицам;Контент, который имеет откровенно сексуальное или порнографическое содержание;Контент, содержащий вирусы и/или другие программы (коды, скрипты, активный контент и т.п.), предназначенные для прекращения или отказа функционирования, сбора информации, ведущему к потере конфиденциальности или эксплуатации, получению несанкционированного доступа к системным ресурсам, ограничению функционирования какого-либо программного обеспечения, аппаратному обеспечению или средств связи и прочих действий с целью причинения ущерба;Контент, который нарушает законодательство в сфере распространения материала эксплуатации людей и детей, расизма производства и продажи оружия, и/или запрещенных веществ, и/или незаконный, вредоносный, угрожающий, насильственный, оскорбляющий, деликатный, дискредитирующий, вульгарный, непристойный, порочащий, посягающий на чью-либо личную жизнь, призывающий к ненависти, или недопустимые по расовым, этническим и другим соображениям.
 

3.2. Вы соглашаетесь не наносить вреда репутации Фотохостинг любыми действиями или бездействием.

 

3.3. Вы не будете подстрекать или содействовать какому-либо нарушению этого Пользовательского соглашения третьими сторонами.

 

3.4. Вы соглашаетесь не использовать автоматические программы или скрипты для доступа к Фотохостинг, кроме случаев, одобренных самим сервисом WebFile.

 

3.5. Вы соглашаетесь не получать доступа к ресурсу Фотохостинг посредством использования какой-либо технологии или других способов, кроме тех, что предоставляет WebFile.

 

3.6. Вы соглашаетесь не изменять и не модифицировать любой аспект услуг.

 

3.7. Пользуясь услугами Фотохостинг, вы полностью действуете в рамках применимого законодательства.

 

4. Аккаунты пользователей Фотохостинг

 

4.1.Для получения доступа к дополнительным услугам ресурса Фотохостинг вы можете добровольно создать пользовательский аккаунт на ресурсе WebFile.

 

4.2. Вся информация пользовательского аккаунта, включая платёжные данные, e-mail и персональную информацию, которая предоставляется вами для ресурса WebFile является исчерпывающей, верной и точной.

 

4.3. В случае, если информация, которая содержится в вашем пользовательском аккаунте, становится неверной или вводящей в заблуждение, вы соглашаетесь немедленно обновить ее.

 

4.4. В пользовательском аккаунте вы указываете ваш электронный адрес. Вы будете регулярно проверять этот e-mail для получения и ознакомления уведомлений, которые присылаются сервисом WebFile.

 

4.5. Вы несете полную ответственность за сохранность информации и доступ к вашему аккаунту (ваши логин и пароли) и прочей конфиденциальной информации, которая касается доступа к услугам.

 

4.6. Вы соглашаетесь не передавать третьим лицам ваш логин, пароль и прочую информацию, которая касается доступа к пользовательскому аккаунту.

 

5. Ответственность

 

5.1.Вы несете полную ответственность за любую информацию и контент, загруженный и/или предоставленный вами на ресурс Фотохостинг.

 

5.2. Фотохостинг не несет ответственность за информацию и контент, размещенный вами и/или другими пользователями.

 

6. Гарантии

 

6.1. Вы соглашаетесь, что использование Вами услуг должна быть на свой страх и риск.

 

6.2. Программное обеспечение и услуги в рамках данного Пользовательского соглашения и любые дополнительные политики предоставляются Вам без каких-либо гарантий или обязательств. WebFileне несет ответственности за:

 

Ошибки или неточности содержания,Потерю любых ваших данных или потерю бизнесс и финансовых недостатков для вас, как результат любых потерь или повреждений, произошедших вследствие использования Вами услугЛюбой последующий или косвенной потери прибыли или экономической выгоды.персональные травмы или повреждения имущества, любого характера, в результате Вашего доступа и использования услуг,любой несанкционированный доступ или использование WebFile, обеспечивающий безопасность серверов и / или любую персональную информацию и / или финансовую информацию, хранящуюся в нем,Скорость соединения, любое прерывание или прекращение услуг.любые ошибки, вирусы, трояны и т.п., которые могут быть переданы через услуги третьими лицами и / илилюбые ошибки или упущения в любом Контенте или за любые убытки или ущерб любого рода, понесенные в результате использования любого контента.
 

6.3. Фотохостинг не несет ответственности за любой товар или услугу, рекламируемую или предлагаемую третьими лицами через Услуги Фотохостинг, показаны в любом баннере или другой рекламе.

 

6.4. В частности, вы обратили внимание и соглашаетесь, что Фотохостинг не несет ответственности за клеветнические содержания, оскорбительные или незаконные действия любой третьей стороной. Риск причинения вреда или ущерба от такого содержания целиком возлагается на вас.

 

6.5. Вы соглашаетесь возместить ущерб и защитить Фотохостинг от любых претензий, включая разумные гонорары адвокатов, какой-либо третьей стороной в связи с / или вытекающими из Контента, представленного или доступного через WebFile, или нарушение каких-либо прав третьими лицами в отношении Контента.

 

7. Выплаты

 

7.1. Услуги, предоставляемые вам Фотохостинг, оплачиваются.

 

7.2. Услуги оплачиваются путем применения платных услуг, которые снимают определенные ограничения и / или обязательства.

 

8. Дополнительные условия

 

8.1. Вы подтверждаете, что в полной мере способны и компетентны в заключении настоящего Пользовательского Соглашения и соблюдении его условий.

 

8.2. После вхождения в это Пользовательское соглашение от имени организации, вы выполняете эти условия для организации и подтверждаете свой авторитет, чтобы связать организацию с этими условиями. В таком случае термины «вы» и «ваш» относятся к вам, как реальному человеку, а также к организации.

 

8.3. Фотохостинг оставляет за собой право по своему собственному усмотрению изменять или удалять любую опубликованную информацию, приостановить, прекратить или ограничить доступ к услуге в любой момент за нарушение Пользовательского Соглашения, повторное нарушение авторских прав, нанесенние любого ущерба WebFile или по любой другой причине, которая может привести к юридической ответственности WebFile, без возмещения какого-либо ущерба, с уведомлением или без него, без ответственности за любой вред, который мог бы быть вызван таковыми действиями.

 

8.4. Фотохостинг оставляет за собой право в любое время изменять или вносить поправки в условия данного Пользовательского соглашения, публикуя новые условия по ссылкам, которые указаны в П.1.1. Вы обязуетесь регулярно просматривать правила. Поправки и/или изменения условий Пользовательского соглашения являются обязательными, кроме случаев, когда вы прекращаете пользование услугами, после их обновления администрацией ресурса WebFile.

 

8.5. Любое общественное содержание хранится на сайте с соответствующими условиями, за исключением просьбы загрузчика или другой законной стороны к обратному.

 

8.6. Фотохостинг оставляет за собой право удалить содержание в случае, если оно превышает допустимое пространство в файлового хранилища до вашей отмены или сокращения приобретаемого места в нем.

 

8.7. Любая информация, документация, продукты, логотипы, графические данные, звуки, графический пользовательский интерфейс, программное обеспечение, предоставленное WebFile (за исключением контента), являются собственностью WebFile и/или используются на основании лицензий, являются объектом авторского права и права на интеллектуальную собственность соответственно с применимым законодательством.

 

8.8. Вы не имеете право использовать интеллектуальную собственность Фотохостинг, за исключением пользования услугами в обычном порядке и/или при условии ясно выраженного согласия со стороны WebFile.

 

8.9. Если любое из этих условий можно считать неясным, недействительным или по какой-нибудь причине не имеющим юридической силы, такое условие должно считаться отделимым от остальных условий, и не должно затрагивать законность и юридическую силу всех остальных условий.